export function TermsOfService() {
  return (
    <div className="w-full flex flex-row justify-center align-middle">
      <div className="max-w-7xl w-[95vw] flex flex-col justify-center">
        <h1 className="text-4xl font-bold text-center mb-10">
          Политика конфиденцательности
        </h1>
        <div className="border border-neutral-600 rounded-2xl p-5 bg-neutral-900 flex flex-col gap-5 text-xl">
          <h1>Политика в отношении обработки персональных данных</h1>

          <p>
            <strong>Дата вступления в силу:</strong> 10 октября 2025 г.
          </p>

          <p>
            Настоящая Политика в отношении обработки персональных данных (далее
            — Политика) действует в отношении всей информации, которую{" "}
            <strong>
              [Ваше полное наименование или ФИО, если вы ИП или физическое лицо]
            </strong>
            , (далее — Оператор), может получить о Пользователе во время
            использования им сайта мессенджера "Min" (далее — Сервис).
          </p>

          <p>
            Использование Сервиса означает безоговорочное согласие Пользователя
            с настоящей Политикой и указанными в ней условиями обработки его
            персональных данных. В случае несогласия с этими условиями
            Пользователь должен воздержаться от использования Сервиса.
          </p>

          <h2>1. Общие положения</h2>
          <p>
            1.1. Настоящая Политика разработана в соответствии с требованиями
            Федерального закона от 27.07.2006 г. № 152-ФЗ «О персональных
            данных» и определяет порядок обработки персональных данных и меры по
            обеспечению безопасности персональных данных, предпринимаемые
            Оператором.
          </p>
          <p>
            1.2. Оператор ставит своей важнейшей целью и условием осуществления
            своей деятельности соблюдение прав и свобод человека и гражданина
            при обработке его персональных данных, в том числе защиты прав на
            неприкосновенность частной жизни, личную и семейную тайну.
          </p>
          <p>
            1.3. Оператор не проверяет достоверность персональных данных,
            предоставляемых Пользователем, и не имеет возможности оценивать его
            дееспособность. Оператор исходит из того, что Пользователь
            предоставляет достоверные и достаточные персональные данные и
            поддерживает эту информацию в актуальном состоянии.
          </p>

          <h2>2. Состав и цели сбора персональных данных</h2>
          <p>
            2.1. Сервис собирает и хранит только те персональные данные, которые
            необходимы для предоставления полного функционала мессенджера.
          </p>

          <h3>
            2.2. Оператор обрабатывает следующие персональные данные
            Пользователя:
          </h3>
          <ul>
            <li>
              <strong>Обязательные данные для регистрации:</strong>
              <ul>
                <li>Имя пользователя (логин);</li>
                <li>Пароль (хранится в зашифрованном виде).</li>
              </ul>
            </li>
            <li>
              <strong>
                Опциональные данные (предоставляются Пользователем по желанию):
              </strong>
              <ul>
                <li>Информация в разделе "О себе";</li>
                <li>Дата рождения;</li>
                <li>Аватар (изображение профиля);</li>
                <li>Имя (реальное или вымышленное).</li>
              </ul>
            </li>
          </ul>

          <h3>2.3. Цели обработки персональных данных:</h3>
          <ul>
            <li>Идентификация и авторизация Пользователя в Сервисе.</li>
            <li>
              Предоставление Пользователю доступа к персонализированным ресурсам
              Сервиса, включая чаты и обмен сообщениями.
            </li>
            <li>
              Отображение профиля Пользователя для других участников Сервиса в
              соответствии с настройками Пользователя.
            </li>
            <li>
              Обеспечение функционирования Сервиса, включая обмен сообщениями и
              вложениями.
            </li>
          </ul>

          <h3>2.4. Использование файлов cookie:</h3>
          <ul>
            <li>
              Сервис использует обязательные (технические) файлы cookie для
              обеспечения функционирования процедуры авторизации и поддержания
              сессии Пользователя. Эти файлы необходимы для корректной работы
              сайта.
            </li>
            <li>
              Оператор не использует аналитические, маркетинговые или иные
              отслеживающие файлы cookie.
            </li>
          </ul>

          <h2>3. Условия и порядок обработки персональных данных</h2>
          <p>
            3.1. Обработка персональных данных осуществляется Оператором в
            соответствии с законодательством Российской Федерации.
          </p>

          <h3>3.2. Хранение данных:</h3>
          <ul>
            <li>
              Базы данных, содержащие персональные данные граждан Российской
              Федерации, а именно: информация о профиле пользователя (имя
              пользователя, пароль), чаты и сообщения, хранятся на серверах,
              расположенных на территории Российской Федерации.
            </li>
            <li>
              <strong>Хранение на сторонних сервисах:</strong> Файлы,
              загружаемые Пользователем (аватарки и вложения в сообщениях), для
              обеспечения надежности и доступности хранятся на серверах
              облачного хранилища ООО «ЯНДЕКС» (Яндекс.Облако). Оператор
              поручает обработку (хранение) этих данных указанному лицу, при
              этом Оператор несет ответственность перед Пользователем за
              действия указанного лица. Оператор гарантирует, что предприняты
              все необходимые меры для обеспечения конфиденциальности данных,
              передаваемых на хранение.
            </li>
          </ul>

          <p>
            3.3. В отношении персональных данных Пользователя сохраняется их
            конфиденциальность, кроме случаев добровольного предоставления
            Пользователем информации о себе для общего доступа неограниченному
            кругу лиц.
          </p>
          <p>
            3.4. Оператор вправе передать персональные данные Пользователя
            третьим лицам только в случаях, предусмотренных законодательством
            Российской Федерации (например, по запросу государственных органов).
          </p>

          <h2>4. Права Пользователя</h2>
          <p>4.1. Пользователь имеет право:</p>
          <ul>
            <li>
              Получать информацию, касающуюся обработки его персональных данных.
            </li>
            <li>
              Требовать уточнения своих персональных данных, их блокирования или
              уничтожения в случае, если данные являются неполными, устаревшими,
              недостоверными, незаконно полученными или не являются необходимыми
              для заявленной цели обработки.
            </li>
            <li>Отозвать свое согласие на обработку персональных данных.</li>
            <li>
              На защиту своих прав и законных интересов, в том числе на
              возмещение убытков и компенсацию морального вреда в судебном
              порядке.
            </li>
          </ul>
          <p>
            4.2. Пользователь может в любой момент изменить или удалить
            предоставленные им персональные данные (кроме обязательных для
            регистрации) через интерфейс своего аккаунта в Сервисе.
          </p>
          <p>
            4.3. Для отзыва согласия на обработку персональных данных и/или
            удаления своего аккаунта и всех связанных с ним данных, Пользователь
            должен направить соответствующий запрос Оператору по контактным
            данным, указанным в разделе 7 настоящей Политики.
          </p>

          <h2>5. Меры по защите персональных данных</h2>
          <p>
            5.1. Оператор принимает необходимые правовые, организационные и
            технические меры для защиты персональных данных от неправомерного
            или случайного доступа, уничтожения, изменения, блокирования,
            копирования, распространения, а также от иных неправомерных действий
            третьих лиц.
          </p>

          <h2>6. Заключительные положения</h2>
          <p>
            6.1. Оператор вправе вносить изменения в настоящую Политику
            конфиденциальности. При внесении изменений в актуальной редакции
            указывается дата последнего обновления. Новая редакция Политики
            вступает в силу с момента ее размещения, если иное не предусмотрено
            новой редакцией Политики.
          </p>
          <p>
            6.2. Действующая редакция Политики постоянно доступна на странице по
            адресу:{" "}
            <strong>
              <a href="https://min.krunpy.ru/terms-of-service">
                https://min.krunpy.ru/terms-of-service
              </a>
            </strong>
            .
          </p>
          <p>
            6.3. К настоящей Политике и отношениям между Пользователем и
            Оператором, возникающим в связи с применением Политики
            конфиденциальности, подлежит применению право Российской Федерации.
          </p>

          <h2>7. Контактная информация Оператора</h2>
          <ul>
            <li>
              <strong>ФИО:</strong> Глинин Максим Сергеевич
            </li>
            <li>
              <strong>Электронная почта для связи:</strong>{" "}
              maksimglinin17984@gmail.com
            </li>
          </ul>
        </div>
      </div>
    </div>
  );
}
